src/SimplyTestable/ApiBundle/Tests/Fixtures/Data/SimplyTestable/ApiBundle/Tests/Functional/Command/Stripe/Event/ProcessCommand/ByEventType/CustomerSubscriptionUpdated/PlanChange/StripeEvents/WithoutDiscount/customer.subscription.updated.planchange.json

{
  "id": "evt_2Qom1oCNf7m5vR",
  "created": 1377174289,
  "livemode": true,
  "type": "customer.subscription.updated",
  "data": {
    "object": {
      "plan": {
        "interval": "month",
        "name": "Agency",
        "amount": 1900,
        "currency": "gbp",
        "id": "agency-19",
        "object": "plan",
        "livemode": true,
        "interval_count": 1,
        "trial_period_days": 30
      },
      "object": "subscription",
      "start": 1377174289,
      "status": "{{subscription_status}}",
      "customer": "{{stripe_customer}}",
      "cancel_at_period_end": false,
      "current_period_start": 1373885063,
      "current_period_end": 1405427088,
      "ended_at": null,
      "trial_start": 1373885063,
      "trial_end": 1405427088,
      "canceled_at": null,
      "quantity": 1
    },
    "previous_attributes": {
      "plan": {
        "interval": "month",
        "name": "Personal",
        "amount": 900,
        "currency": "gbp",
        "id": "personal-9",
        "object": "plan",
        "livemode": true,
        "interval_count": 1,
        "trial_period_days": 30
      },
      "start": 1373885063,
      "current_period_end": 1405421062,
      "trial_end": 1405421062
    }
  },
  "object": "event",
  "pending_webhooks": 1,
  "request": "iar_2QomKs9vMVY0bC"
}